7.server_outGameMsg_d20_u25_e2.yml
config:
  target: "http://20.214.176.36"
  socketio:
    path: "/socket.io"
    querry:
      EIO: 4
      transport: polling
      t: "{{$randomString(7)}}"
    transports:
      - websocket
  phases:
    - duration: 50
      arrivalRate: 10
      name: "small load test"
scenarios:
  - name: "Get All Room List"
    flow:
      - get:
          url: "/api/rooms"


  - name: "Join & Chat & Leave Room Test"
    engine: "socketio"
    flow:

      - emit:
          channel: "joinRoom"
          data:
            room: "64bb8c40fe1da2c7b45ebae6"
            nickname: "{{$randomString(5)}}"
            userId: "123"
      - think: 1
  
  # - name: "Chat Test"
  #   engine: "socketio"
  #   flow:
      - emit:
          channel: "messageOutGame"
          data:
            room: "64bb8c40fe1da2c7b45ebae6"
            nickname: "{{$randomString(5)}}"
            message: "테스트 중 입니다"
      - think: 1

  # - name: "Leave Room Test"
  #   engine: "socketio"
  #   flow:
      - emit:
          channel: "leaveRoom"
          data:
            room: "64bb8c40fe1da2c7b45ebae6"
            userName: "{{$randomString(5)}}"
      - think: 1